In [8]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [9]:
%sql sqlite:///library.db

'Connected: @library.db'

In [28]:
%%sql
CREATE TABLE Entries(
    entryID  INTEGER PRIMARY KEY,
    title    VARCHAR(500) NOT NULL,
    year     DATE,
    author   VARCHAR(200),
    category VARCHAR(100),
    CHECK (category IN ('PRINT BOOK', 'ONLINE BOOK', 'MAGAZINE', 'JOURNAL', 'CD', 'RECORD') )
);

 * sqlite:///library.db
Done.

[]

In [24]:
%%sql
CREATE TABLE Items(
    itemID INTEGER PRIMARY KEY,
    status VARCHAR(9) CHECK (status IN ('AVAILABLE', 'BORROWED') ),
    entryID INTEGER,
    FOREIGN KEY (entryID) REFERENCES Entries(entryID)
);

 * sqlite:///library.db
Done.

[]

In [9]:
%%sql
CREATE TABLE Patrons (
    libraryID INTEGER PRIMARY KEY,
    name VARCHAR(30) NOT NULL,
    dob DATE,
    phone VARCHAR(15) NOT NULL
);

 * sqlite:///library.db
Done.

[]

In [11]:
%%sql
CREATE TABLE Events (
    eventID INTEGER PRIMARY KEY,
    name VARCHAR(200) NOT NULL,
    time DATE,
    location VARCHAR(10)
);

 * sqlite:///library.db
Done.

[]

In [12]:
%%sql
CREATE TABLE Personnel (
    personnelID INTEGER PRIMARY KEY,
    name VARCHAR(30) NOT NULL,
    dob DATE,
    position VARCHAR(20) CHECK (position IN ('Librarian', 'Volunteer', 'Director', 'Manager', 'IT Technician') ),
    email VARCHAR(50)
);

 * sqlite:///library.db
Done.

[]

In [25]:
%%sql
CREATE TABLE Borrow (
    borrowID INTEGER PRIMARY KEY,
    itemID INTEGER,
    libraryID INTEGER,
    borrowDate DATE,
    returnDate DATE,
    returned VARCHAR(3) CHECK (returned IN ('Yes', 'No') ),
    outstandingFee INTEGER CHECK (outstandingFee >= 0),
    FOREIGN KEY (itemID) REFERENCES Items(itemID),
    FOREIGN KEY (libraryID) REFERENCES Patrons(libraryID)
    CHECK (borrowDate < returnDate)
);

 * sqlite:///library.db
Done.

[]

In [16]:
%%sql
CREATE TABLE Attend(
    libraryID INTEGER,
    eventID INTEGER,
    PRIMARY KEY (libraryID, eventID),
    FOREIGN KEY (libraryID) REFERENCES Patrons(libraryID),
    FOREIGN KEY (eventID) REFERENCES Events(eventID)
);

 * sqlite:///library.db
Done.

[]

In [26]:
%%sql
CREATE TRIGGER onBorrow
AFTER INSERT ON Borrow
WHEN NEW.returned="No"
BEGIN
    UPDATE Items
    SET status='BORROWED'
    WHERE NEW.itemID = Items.itemID;
END;

 * sqlite:///library.db
Done.

[]

In [4]:
%%sql
DROP TRIGGER onReturn;

 * sqlite:///library.db
Done.

[]

In [27]:
%%sql
CREATE TRIGGER onReturn
AFTER UPDATE OF returned ON Borrow
WHEN OLD.returned='No' AND NEW.returned='Yes'
BEGIN
    UPDATE Items
    SET status='AVAILABLE'
    WHERE NEW.itemID = Items.itemID;
END;

 * sqlite:///library.db
Done.

[]

('PRINT BOOK', 'ONLINE BOOK', 'MAGAZINE', 'JOURNAL', 'CD', 'RECORD')

In [30]:
%%sql
INSERT INTO Entries(title, year, author, category)
VALUES
    ("Moby Dick", 1851, "Herman Melville", "PRINT BOOK"),
    ("The Martian Chronicle", 1950, "Ray Bradbury", "PRINT BOOK"),
    ("Data Structure and Algorithm in C++", 2003 ,"Michael Goodrich et al", "ONLINE BOOK"),
    ("Nineteen Eighty-Four", 1949, "George Orwell", "ONLINE BOOK"),
    ("V for Vendetta", 2005, "James McTeigue", "CD"),
    ("National Geographic June", 2023, "Various", "MAGAZINE"),
    ("National Geographic July", 2023, "Various", "MAGAZINE"),
    ("National Geographic August", 2022, "Various", "MAGAZINE"),
    ("Cosmopolitan January", 2012, "Various", "MAGAZINE"),
    ("Nature May", 2020, "Various", "JOURNAL"),
    ("Thriller", 1982, "Michael Jackson", "RECORD"),
    ("Do Androids Dream of Electric Sheep", 1968, "Philip K. Dick", "PRINT BOOK"),
    ("We Can Remember It for You Wholesale", 1966, "Philip K. Dick", "PRINT BOOK"),
    ("The Matrix ", 1999, "Joel Silver", "CD");

 * sqlite:///library.db
14 rows affected.

[]

In [11]:
%%sql
SELECT * FROM Entries;

 * sqlite:///library.db
Done.

[(1, 'Moby Dick', 1851, 'Herman Melville', 'PRINT BOOK'),
 (2, 'The Martian Chronicle', 1950, 'Ray Bradbury', 'PRINT BOOK'),
 (3, 'Data Structure and Algorithm in C++', 2003, 'Michael Goodrich et al', 'ONLINE BOOK'),
 (4, 'Nineteen Eighty-Four', 1949, 'George Orwell', 'ONLINE BOOK'),
 (5, 'V for Vendetta', 2005, 'James McTeigue', 'CD'),
 (6, 'National Geographic June', 2023, 'Various', 'MAGAZINE'),
 (7, 'National Geographic July', 2023, 'Various', 'MAGAZINE'),
 (8, 'National Geographic August', 2022, 'Various', 'MAGAZINE'),
 (9, 'Cosmopolitan January', 2012, 'Various', 'MAGAZINE'),
 (10, 'Nature May', 2020, 'Various', 'JOURNAL'),
 (11, 'Thriller', 1982, 'Michael Jackson', 'RECORD'),
 (12, 'Do Androids Dream of Electric Sheep', 1968, 'Philip K. Dick', 'PRINT BOOK'),
 (13, 'We Can Remember It for You Wholesale', 1966, 'Philip K. Dick', 'PRINT BOOK'),
 (14, 'The Matrix ', 1999, 'Joel Silver', 'CD'),
 (15, 'The Matrix', 1999, 'Joel Silver', 'CD')]

In [21]:
%%sql
DELETE FROM Items WHERE entryID=90;

 * sqlite:///library.db
1 rows affected.

[]

In [28]:
%%sql
INSERT INTO Items(status, entryID)
VALUES
    ("AVAILABLE", 14),
    ("AVAILABLE", 13),
    ("AVAILABLE", 12),
    ("AVAILABLE", 11),
    ("AVAILABLE", 10),
    ("AVAILABLE", 9),
    ("AVAILABLE", 8),
    ("AVAILABLE", 7),
    ("AVAILABLE", 6),
    ("AVAILABLE", 5),
    ("AVAILABLE", 4),
    ("AVAILABLE", 3),
    ("AVAILABLE", 2),
    ("AVAILABLE", 1),
    ("AVAILABLE", 1),
    ("AVAILABLE", 1),
    ("AVAILABLE", 2),
    ("AVAILABLE", 3),
    ("AVAILABLE", 4),
    ("AVAILABLE", 5),
    ("AVAILABLE", 6),
    ("AVAILABLE", 7),
    ("AVAILABLE", 8),
    ("AVAILABLE", 9),
    ("AVAILABLE", 10),
    ("AVAILABLE", 11),
    ("AVAILABLE", 12),
    ("AVAILABLE", 13),
    ("AVAILABLE", 14),
    ("AVAILABLE", 14),
    ("AVAILABLE", 13);

 * sqlite:///library.db
31 rows affected.

[]

In [13]:
%%sql
SELECT * FROM Items

 * sqlite:///library.db
Done.

[(1, 'AVAILABLE', 14),
 (2, 'BORROWED', 13),
 (3, 'BORROWED', 12),
 (4, 'BORROWED', 11),
 (5, 'AVAILABLE', 10),
 (6, 'AVAILABLE', 9),
 (7, 'BORROWED', 8),
 (8, 'AVAILABLE', 7),
 (9, 'AVAILABLE', 6),
 (10, 'AVAILABLE', 5),
 (11, 'AVAILABLE', 4),
 (12, 'AVAILABLE', 3),
 (13, 'BORROWED', 2),
 (14, 'AVAILABLE', 1),
 (15, 'AVAILABLE', 1),
 (16, 'BORROWED', 1),
 (17, 'AVAILABLE', 2),
 (18, 'AVAILABLE', 3),
 (19, 'AVAILABLE', 4),
 (20, 'AVAILABLE', 5),
 (21, 'AVAILABLE', 6),
 (22, 'AVAILABLE', 7),
 (23, 'AVAILABLE', 8),
 (24, 'AVAILABLE', 9),
 (25, 'AVAILABLE', 10),
 (26, 'AVAILABLE', 11),
 (27, 'AVAILABLE', 12),
 (28, 'AVAILABLE', 13),
 (29, 'AVAILABLE', 14),
 (30, 'AVAILABLE', 14),
 (31, 'AVAILABLE', 13),
 (32, 'AVAILABLE', 15),
 (33, 'AVAILABLE', 15)]

In [36]:
%%sql
INSERT INTO Patrons(name, dob, phone)
VALUES
    ("Alice", "1995-12-07", "+1-234-567-7890"),
    ("Bob", "1997-04-30", "+84-843-257-345"),
    ("Charlie", "1980-05-01", "1-778-890-2314"),
    ("Yang", "1999-01-01", "+1-535-234-5473"),
    ("Daniel", "2005-06-30", "322 456 1234"),
    ("Ed", "2006-07-12", "097 780 4259"),
    ("Frank Sinatta", "1993", "888 909 0634"),
    ("Joyce", "1996-01-01", "+22 342 242 3221"),
    ("Carl", "2004-02-29", "+1 234-334-5849"),
    ("Yang", "1999-02-07", "567 891 0111");

 * sqlite:///library.db
10 rows affected.

[]

In [37]:
%%sql
SELECT * FROM Patrons;

 * sqlite:///library.db
Done.

[(1, 'Alice', '1995-12-07', '+1-234-567-7890'),
 (2, 'Bob', '1997-04-30', '+84-843-257-345'),
 (3, 'Charlie', '1980-05-01', '1-778-890-2314'),
 (4, 'Yang', '1999-01-01', '+1-535-234-5473'),
 (5, 'Daniel', '2005-06-30', '322 456 1234'),
 (6, 'Ed', '2006-07-12', '097 780 4259'),
 (7, 'Frank Sinatta', 1993, '888 909 0634'),
 (8, 'Joyce', '1996-01-01', '+22 342 242 3221'),
 (9, 'Carl', '2004-02-29', '+1 234-334-5849'),
 (10, 'Yang', '1999-02-07', '567 891 0111')]

In [34]:
%%sql
DELETE FROM Patrons WHERE true;

 * sqlite:///library.db
1 rows affected.

[]

In [38]:
%%sql
INSERT INTO Events(name, time, location)
VALUES
    ("Annual Book Meeting 2023", "2023-07-31", "L4001"),
    ("Fiction Diction", "2023-08-04", "G1234"),
    ("Star Trek Club Monthly", "2023-07-01", "L1001"),
    ("Star Trek Club Monthly", "2023-08-04", "L1001"),
    ("Star Trek Club Monthly", "2023-09-03", "L1001"),
    ("Star Trek Club Monthly", "2023-06-04", "L1001"),
    ("Summer Sale", "2023-07-28", "ALL"),
    ("Tea and Book", "2023-06-12", "DD5555"),
    ("The Joy Luck Club", "2023-06-15", "JL0005"),
    ("The Joy Luck Club", "2023-07-15", "JL0005");

 * sqlite:///library.db
10 rows affected.

[]

In [23]:
%%sql
SELECT * FROM Events

 * sqlite:///library.db
Done.

[(1, 'Annual Book Meeting 2023', '2023-07-31', 'L4001'),
 (2, 'Fiction Diction', '2023-08-04', 'G1234'),
 (3, 'Star Trek Club Monthly', '2023-07-01', 'L1001'),
 (4, 'Star Trek Club Monthly', '2023-08-04', 'L1001'),
 (5, 'Star Trek Club Monthly', '2023-09-03', 'L1001'),
 (6, 'Star Trek Club Monthly', '2023-06-04', 'L1001'),
 (7, 'Summer Sale', '2023-07-28', 'ALL'),
 (8, 'Tea and Book', '2023-06-12', 'DD5555'),
 (9, 'The Joy Luck Club', '2023-06-15', 'JL0005'),
 (10, 'The Joy Luck Club', '2023-07-15', 'JL0005')]

'Librarian', 'Volunteer', 'Director', 'Manager', 'IT Technician'

In [41]:
%%sql
INSERT INTO Personnel(name, dob, position, email)
VALUES
    ("Ezekiel", "2003-04-08", "Librarian", "eze.gg@hotmail.com"),
    ("Xanatharl", "2000-11-09", "Director", "xlxlx.arl123@yahoo.com"),
    ("Tsera", "1999-03-03", "IT Technician", "theitguy888@hmail.com"),
    ("Manuel", "1977-10-12", "Librarian", "manueltheman0903@myspace.com"),
    ("Eren", "1998-11-11", "Librarian", "friendlylibrarian@canlib.com"),
    ("Andy", "2002-05-22", "IT Technician", "gaothettenem@yahoo.com"),
    ("Colonel", "2003-08-08", "Manager", "boycodon1508@gmail.com"),
    ("Matthew", "2001-09-18", "Manager", "anhkoghiban@inblind.com"),
    ("Bilby", "1998-06-14", "Librarian", "den.hoi.tho.cuoi.cung@fyma.com"),
    ("Ashok", "2002-12-31", "Librarian", "zebessinzewest@inblind.com");

 * sqlite:///library.db
10 rows affected.

[]

In [22]:
%%sql
SELECT * FROM Personnel

 * sqlite:///library.db
Done.

[(1, 'Ezekiel', '2003-04-08', 'Librarian', 'eze.gg@hotmail.com'),
 (2, 'Xanatharl', '2000-11-09', 'Director', 'xlxlx.arl123@yahoo.com'),
 (3, 'Tsera', '1999-03-03', 'IT Technician', 'theitguy888@hmail.com'),
 (4, 'Manuel', '1977-10-12', 'Librarian', 'manueltheman0903@myspace.com'),
 (5, 'Eren', '1998-11-11', 'Librarian', 'friendlylibrarian@canlib.com'),
 (6, 'Andy', '2002-05-22', 'IT Technician', 'gaothettenem@yahoo.com'),
 (7, 'Colonel', '2003-08-08', 'Manager', 'boycodon1508@gmail.com'),
 (8, 'Matthew', '2001-09-18', 'Manager', 'anhkoghiban@inblind.com'),
 (9, 'Bilby', '1998-06-14', 'Librarian', 'den.hoi.tho.cuoi.cung@fyma.com'),
 (10, 'Ashok', '2002-12-31', 'Librarian', 'zebessinzewest@inblind.com'),
 (11, 'Kayla', '2003-04-23', 'Volunteer', 'socsieuquay03@yahoo.com.vn')]

In [30]:
%%sql
INSERT INTO Borrow(itemID, libraryID, borrowDate, returnDate, returned, outstandingFee)
VALUES
    (1, 1, "2022-08-01", "2022-08-15", "Yes", 0),
    (1, 1, "2022-08-17", "2022-08-24", "Yes", 0),
    (14, 5, "2023-05-06", "2023-05-14", "Yes", 15),
    (12, 6, "2023-05-07", "2023-05-15", "Yes", 0),
    (2, 3, "2023-06-12", "2023-06-19", "No", 15),
    (10, 7, "2023-06-15", "2023-06-29", "Yes", 15),
    (4, 4, "2023-07-01", "2023-07-15", "No", 15),
    (3, 6, "2023-07-15", "2023-07-29", "No", 0),
    (6, 9, "2023-07-12", "2023-07-26", "Yes", 0),
    (7, 7, "2023-07-22", "2023-08-04", "No", 0);

 * sqlite:///library.db
10 rows affected.

[]

In [31]:
%%sql
select * from sqlite_master where type = 'trigger';

 * sqlite:///library.db
Done.

[('trigger', 'onBorrow', 'Borrow', 0, 'CREATE TRIGGER onBorrow\nAFTER INSERT ON Borrow\nWHEN NEW.returned="No"\nBEGIN\n    UPDATE Items\n    SET status=\'BORROWED\'\n    WHERE NEW.itemID = Items.itemID;\nEND'),
 ('trigger', 'onReturn', 'Borrow', 0, "CREATE TRIGGER onReturn\nAFTER UPDATE OF returned ON Borrow\nWHEN OLD.returned='No' AND NEW.returned='Yes'\nBEGIN\n    UPDATE Items\n    SET status='AVAILABLE'\n    WHERE NEW.itemID = Items.itemID;\nEND")]

In [20]:
%%sql
SELECT * FROM Items;

 * sqlite:///library.db
Done.

[(1, 'AVAILABLE', 14),
 (2, 'BORROWED', 13),
 (3, 'BORROWED', 12),
 (4, 'BORROWED', 11),
 (5, 'AVAILABLE', 10),
 (6, 'AVAILABLE', 9),
 (7, 'BORROWED', 8),
 (8, 'AVAILABLE', 7),
 (9, 'AVAILABLE', 6),
 (10, 'AVAILABLE', 5),
 (11, 'AVAILABLE', 4),
 (12, 'AVAILABLE', 3),
 (13, 'BORROWED', 2),
 (14, 'AVAILABLE', 1),
 (15, 'AVAILABLE', 1),
 (16, 'BORROWED', 1),
 (17, 'AVAILABLE', 2),
 (18, 'AVAILABLE', 3),
 (19, 'AVAILABLE', 4),
 (20, 'AVAILABLE', 5),
 (21, 'AVAILABLE', 6),
 (22, 'AVAILABLE', 7),
 (23, 'AVAILABLE', 8),
 (24, 'AVAILABLE', 9),
 (25, 'AVAILABLE', 10),
 (26, 'AVAILABLE', 11),
 (27, 'AVAILABLE', 12),
 (28, 'AVAILABLE', 13),
 (29, 'AVAILABLE', 14),
 (30, 'AVAILABLE', 14),
 (31, 'AVAILABLE', 13),
 (32, 'AVAILABLE', 15),
 (33, 'AVAILABLE', 15),
 (34, 'AVAILABLE', 90),
 (35, 'AVAILABLE', 16),
 (36, 'AVAILABLE', 16)]

In [19]:
%%sql
SELECT * FROM Borrow;

 * sqlite:///library.db
Done.

[(1, 1, 1, '2022-08-01', '2022-08-15', 'Yes', 0),
 (2, 1, 1, '2022-08-17', '2022-08-24', 'Yes', 0),
 (3, 14, 5, '2023-05-06', '2023-05-14', 'Yes', 15),
 (4, 12, 6, '2023-05-07', '2023-05-15', 'Yes', 0),
 (5, 2, 3, '2023-06-12', '2023-06-19', 'No', 15),
 (6, 10, 7, '2023-06-15', '2023-06-29', 'Yes', 15),
 (7, 4, 4, '2023-07-01', '2023-07-15', 'No', 15),
 (8, 3, 6, '2023-07-15', '2023-07-29', 'No', 0),
 (9, 6, 9, '2023-07-12', '2023-07-26', 'Yes', 0),
 (10, 7, 7, '2023-07-22', '2023-08-04', 'No', 0)]

In [33]:
%%sql
INSERT INTO Attend(libraryID, eventID)
VALUES
    (1, 10),
    (1, 5),
    (2, 7),
    (7, 2),
    (5, 10),
    (3, 6),
    (7, 6),
    (2, 5),
    (5, 4),
    (7, 7);

 * sqlite:///library.db
10 rows affected.

[]

In [24]:
%%sql
SELECT * FROM Attend

 * sqlite:///library.db
Done.

[(1, 10),
 (1, 5),
 (2, 7),
 (7, 2),
 (5, 10),
 (3, 6),
 (7, 6),
 (2, 5),
 (5, 4),
 (7, 7)]

In [4]:
%%sql
SELECT * FROM Borrow

 * sqlite:///library.db
Done.

[(1, 1, 1, '2022-08-01', '2022-08-15', 'Yes', 0),
 (2, 1, 1, '2022-08-17', '2022-08-24', 'Yes', 0),
 (3, 14, 5, '2023-05-06', '2023-05-14', 'Yes', 15),
 (4, 12, 6, '2023-05-07', '2023-05-15', 'Yes', 0),
 (5, 2, 3, '2023-06-12', '2023-06-19', 'No', 15),
 (6, 10, 7, '2023-06-15', '2023-06-29', 'Yes', 15),
 (7, 4, 4, '2023-07-01', '2023-07-15', 'No', 15),
 (8, 3, 6, '2023-07-15', '2023-07-29', 'No', 0),
 (9, 6, 9, '2023-07-12', '2023-07-26', 'Yes', 0),
 (10, 7, 7, '2023-07-22', '2023-08-04', 'No', 0),
 (11, 14, 1, '2023-07-29', '2023-08-12', 'No', 0),
 (12, 15, 1, '2023-07-29', '2023-08-12', 'No', 0),
 (13, 16, 1, '2023-07-29', '2023-08-12', 'No', 0),
 (14, 13, 2, '2023-07-29', '2023-08-12', 'No', 0)]

In [19]:
%%sql
PRAGMA foreign_keys=1;

 * sqlite:///library.db
Done.

[]